In [ ]:
# Importando as ferramentas necessárias
import pandas as pd
# Traduz Python para SQL
from sqlalchemy import create_engine
# Segurança
import os
from dotenv import load_dotenv
# Carrega a senha 
load_dotenv()
# Guarda a senha em uma variável
conexao_render = os.environ.get('DATABASE_URL')
# Criando a conexão com o banco de dados
engine = create_engine(conexao_render)
# Testando o SQL
query = "SELECT * FROM clientes LIMIT 5"
print("Buscando os dados no Render")
# Leva a query e traz a resposta, colocando-a em um DataFrame
df_amostra = pd.read_sql(query, engine)
df_amostra

Buscando os dados no Render

   id_cliente  renda_mensal  score_interno estado_civil
0           1   5245.071230            727     Solteiro
1           2   4292.603548            604       Casado
2           3   5471.532807            616     Solteiro
3           4   6784.544785            934   Divorciado
4           5   4148.769938            308   Divorciado

In [3]:
# Verificando as linhas e colunas da tabela faturas
query_faturas = "SELECT * FROM faturas LIMIT 5"
df_amostra_faturas = pd.read_sql(query_faturas, engine)
df_amostra_faturas

   id_cliente  mes_referencia  valor_fatura  pago_em_dia
0           1               1   4954.620957            1
1           1               2   4974.313479            1
2           1               3    211.124230            1
3           1               4   1840.555543            0
4           1               5    531.341796            1